{
  "backend/main.mo": "Main Motoko actor defining Character type and user management with functions to unlock characters by answering riddles, retrieve unlocked characters, and query all 20 pre-populated characters stored in an array.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including tutorial/onboarding system, Japanese/Korean game aesthetic UI redesign, visual indicators/tooltips, and enhanced anime-style character card effects with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing React components, hooks, pages, and styling for an anime-themed character collection game with tutorial system, authentication, and polished Japanese/Korean game aesthetic.",
  "frontend/index.css": "Tailwind CSS base configuration defining CSS custom properties for light and dark themes using OKLCH color space, including variables for backgrounds, foregrounds, borders, and chart colors.",
  "frontend/index.html": "HTML entry point for the Anime Quest application with viewport meta tag and script reference to the React TypeScript main module.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for GameHome, CharacterRoster, and CharacterDetail pages, wrapped in ThemeProvider and Toaster for notifications.",
  "frontend/src/components/AuthButton.tsx": "Authentication button component managing Internet Identity login/logout with loading states and anime-styled UI using pink color scheme.",
  "frontend/src/components/CharacterCard.tsx": "Enhanced character card component with particle effects, sparkle overlays, premium borders, dynamic glow, tooltips, and distinct locked/unlocked visual states using hover animations.",
  "frontend/src/components/CharacterGrid.tsx": "Grid layout component displaying all characters using CharacterCard with loading states, navigation handling, and responsive design comparing unlocked status.",
  "frontend/src/components/CharacterStory.tsx": "Card component displaying character background story with locked/unlocked states, showing lock icon when locked and full story text when unlocked.",
  "frontend/src/components/Layout.tsx": "Main layout component with animated gradient background, header navigation (Home, Roster, Tutorial), authentication button, and footer. Includes TutorialModal integration and responsive design with Lucide icons.",
  "frontend/src/components/ProgressTracker.tsx": "Displays collection progress card showing unlocked vs total characters (X/20) with a progress bar and percentage completion. Fetches data using useGetAllCharacters and useGetUnlockedCharacters hooks.",
  "frontend/src/components/RiddleChallenge.tsx": "Form component for solving character unlock riddles, featuring a riddle display with background image, text input for answers, and submit button with loading states.",
  "frontend/src/components/Tooltip.tsx": "Reusable tooltip wrapper component using Radix UI primitives with custom styling (purple/pink gradient theme) and configurable positioning and delay.",
  "frontend/src/components/TutorialModal.tsx": "Multi-step tutorial modal with navigation controls explaining game mechanics: character collection, riddle challenges, and progress tracking. Uses Dialog component with step-based content and icons.",
  "frontend/src/components/UnlockSuccessModal.tsx": "Success modal displayed when a character is unlocked, showing character name, appearance description, and a button to view the character story.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useParticleEffect.ts": "Custom React hook that creates and animates a canvas-based particle effect with configurable particle count, managing particle lifecycle, movement, and rendering with pink-colored particles that fade over time.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for character data management, providing queries for fetching all characters, individual characters, and unlocked characters, plus a mutation for unlocking characters with automatic cache invalidation.",
  "frontend/src/index.css": "Global CSS file defining Tailwind configuration, custom CSS variables for dark theme colors (purple/pink palette), font imports (Poppins, Noto Sans JP), and custom animations (float, pulse-glow) for the anime-themed UI.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers, rendering the main App component.",
  "frontend/src/pages/CharacterDetail.tsx": "Character detail page component that displays individual character information, handles riddle challenges for unlocking characters, shows success modals, and manages authentication-gated unlock attempts with toast notifications.",
  "frontend/src/pages/CharacterRoster.tsx": "Character roster page displaying a grid of all 20 characters with header, logo, and tooltips explaining how to unlock characters by clicking on them.",
  "frontend/src/pages/GameHome.tsx": "Home page component featuring a hero banner, game introduction, tutorial modal, progress tracker, and call-to-action buttons to start playing or learn how to play, with authentication prompts for non-authenticated users.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space with purple/pink theme, custom shadows (glow effects), animations, and extended utilities for the anime-themed application.",
  "project_state.json": "Project state file for an Android anime-style character collection game with 20+ unlockable characters, riddles, and Internet Identity authentication. Tracks existing features, known UI/UX issues, and required image assets for tutorial icons, particle effects, card borders, and hero banners."
}